Template_Cases/LaNi5_Absorption/0/hydrogenArea/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
	  location    "0/hydrogenArea";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
#include "../../constant/metalHydrideSettings";

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 293.15;


boundaryField
{
    tankWall
    {
      type                groovyBC;
      variables           "lambda_eff=$epsilon_filter*$lambda_hydrogen+(1-$epsilon_filter)*$lambda_filter;";
      valueExpression     "293.15";
      gradientExpression  "0";
      fractionExpression  "1/(1+(lambda_eff/($h_metal*mag(delta())))*(($lambda_wall+$h_metal*$delta_wall)/$lambda_wall))";
      value               $internalField;
    }

    inlet
    {
      type                groovyBC;
      variables           "lambda_eff=$epsilon_filter*$lambda_hydrogen+(1-$epsilon_filter)*$lambda_filter;";
      valueExpression     "293.15";
      gradientExpression  "0";
      fractionExpression  "1/(1+(lambda_eff/($h_hydrogen*mag(delta()))))";
      value               $internalField;
    }

    "(front|back)"
    {
        type            wedge;
    }

    hydrogenArea_to_metalArea
    {
        type            fixedValue;
        value           $internalField;
    }
}

// ************************************************************************* //
