Template_Cases/LaNi5_Absorption/0/hydrogenArea/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
	location    "0/hydrogenArea";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField		uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            zeroGradient;
    }

    "(tankWall.*)"
    {
        type            noSlip;
    }

    "(front|back)"
    {
        type            wedge;
    }

    hydrogenArea_to_metalArea
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
